/**
 * 此js用于说明响应式布局的基本理论
 */
/**
 * 一：内容策略:规划和管理内容的一种方法
 * 1:创建网站或者页面的时候以内容策略为导向，而不是以设计优先
 * 2:网站展示的内容仅展示用户需要的，而不是展示你自以为需要的
 * 3:如何精简：从商业目标和用户需求两方面考虑
 * 4:内容审计：内容盘点，列一个清单，需要展示什么
 */
/**
 * 二：内容如何编写
 * 1:倒金字塔的思维方式:把重要的内容放在前面，以此类推
 * 2:使用分级标题
 * 3:简单明了，段落应该简短，一般不超过100字
 */

/**
 * 三:html基本属性说明:
 * 1:meta元素属性
 * ①charset="UTF-8":字符集charset:规定字符的编码，字符编码的本质是将字母，数值和符号翻译成计算机能够识别的二进制语言
 * ②name="viewport":响应式布局的一般设置;
 * ③width=device-width：以全尺寸渲染页面
 * ④initial-scale=1.0:首次加载页面如何缩放，默认为1，按width属性确定的宽度来渲染
 * ⑤user-scalable=no:不给用户缩放
 */
